stm32-rs/stm32f3xx-hal/src/pwm.rs
// TIM8

#[cfg(any(feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim8 {
    () => {
        use crate::stm32::TIM8;

        /// Output Compare Channel 1 of Timer 8 (type state)
        pub struct TIM8_CH1 {}
        /// Output Compare Channel 2 of Timer 8 (type state)
        pub struct TIM8_CH2 {}
        /// Output Compare Channel 3 of Timer 8 (type state)
        pub struct TIM8_CH3 {}
        /// Output Compare Channel 4 of Timer 8 (type state)
        pub struct TIM8_CH4 {}

        pwm_timer_with_break!(
            tim8,
            TIM8,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim8rst,
            tim8en,
            [TIM8_CH1,TIM8_CH2,TIM8_CH3,TIM8_CH4],
            [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_n_channel!(TIM8, TIM8_CH1, u16, cc1e, cc1ne, ccr1, ccr);
        pwm_pin_for_pwm_n_channel!(TIM8, TIM8_CH2, u16, cc2e, cc2ne, ccr2, ccr);
        pwm_pin_for_pwm_n_channel!(TIM8, TIM8_CH3, u16, cc3e, cc3ne, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM8, TIM8_CH4, u16, cc4e, ccr4, ccr);

        //Pins
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH1, output_to_pa15, PA15, AF2, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH1, output_to_pb6, PB6, AF2, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH1, output_to_pc6, PC6, AF4, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH1, output_to_pa7, PA7, AF4, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH1, output_to_pb3, PB3, AF4, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH1, output_to_pc10, PC10, AF4, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM8, TIM8_CH2, output_to_pa14, PA14, AF5, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH2, output_to_pb8, PB8, AF10, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH2, output_to_pc7, PC7, AF4, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH2, output_to_pb0, PB0, AF4, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH2, output_to_pb4, PB4, AF4, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH2, output_to_pc11, PC11, AF4, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM8, TIM8_CH3, output_to_pb9, PB9, AF10, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH3, output_to_pc8, PC8, AF4, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH3, output_to_pb1, PB1, AF4, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH3, output_to_pb5, PB5, AF3, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithNPins, TIM8, TIM8_CH3, output_to_pc12, PC12, AF4, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM8, TIM8_CH3, output_to_pc9, PC9, AF4, ccmr2_output, oc4m, oc4pe);
        pwm_channel_pin!(WithPins, TIM8, TIM8_CH3, output_to_pd1, PD1, AF4, ccmr2_output, oc4m, oc4pe);
    }
}

#[cfg(any(feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
tim8!();


// TIM12

#[cfg(feature = "stm32f373")]
macro_rules! tim12 {
    () => {
        use crate::stm32::TIM12;

        /// Output Compare Channel 1 of Timer 12 (type state)
        pub struct TIM12_CH1 {}
        /// Output Compare Channel 2 of Timer 12 (type state)
        pub struct TIM12_CH2 {}
        /// Output Compare Channel 3 of Timer 12 (type state)
        pub struct TIM12_CH3 {}
        /// Output Compare Channel 4 of Timer 12 (type state)
        pub struct TIM12_CH4 {}

        pwm_timer_basic!(
            tim12,
            TIM12,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim12rst,
            tim12en,
            [TIM12_CH1,TIM12_CH2],
            [PwmChannel,PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM12, TIM12_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM12, TIM12_CH2, u16, cc2e, ccr2, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM12, TIM12_CH1, output_to_pa4, PA4, AF10, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM12, TIM12_CH1, output_to_pa14, PA14, AF10, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM12, TIM12_CH1, output_to_pb14, PB14, AF10, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM12, TIM12_CH2, output_to_pa5, PA5, AF10, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM12, TIM12_CH2, output_to_pa15, PA15, AF10, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM12, TIM12_CH2, output_to_pb15, PB15, AF10, ccmr1_output, oc2m, oc2pe);
    }
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim12!();


// TIM13

#[cfg(feature = "stm32f373")]
macro_rules! tim13 {
    () => {
        use crate::stm32::TIM13;

        /// Output Compare Channel 1 of Timer 13 (type state)
        pub struct TIM13_CH1 {}
        /// Output Compare Channel 2 of Timer 13 (type state)
        pub struct TIM13_CH2 {}
        /// Output Compare Channel 3 of Timer 13 (type state)
        pub struct TIM13_CH3 {}
        /// Output Compare Channel 4 of Timer 13 (type state)
        pub struct TIM13_CH4 {}

        pwm_timer_basic!(
            tim13,
            TIM13,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim13rst,
            tim13en,
            [TIM13_CH1],
            [PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM13, TIM13_CH1, u16, cc1e, ccr1, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pa6, PA6, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pa9, PA9, AF2, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pb3, PB3, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pc4, PC4, AF2, ccmr1_output, oc1m, oc1pe);
    }
}

